n=int(input())
if 0<n<1000:
 if 4<n<10:
     print(n, "программистов")
 if 1<n%1000<5:
    print(n,"программиста")
 if 20<n<100:
    if 1<n%10<5:
        print(n,"программиста")
 if 100<n<1000:
    if 1<n%100<10 and 1<n%10<5:
        print(n, "программиста")
 if 10<n%100<20:
     print(n, "программистов")
 if 20<n%100<100 and 1<n%10<5:
    print(n,"программиста")
 if n%100>20 and n%10==1:
    print(n, "программист")
 if n%100==1:
    print(n, "программист")
 if n%10==0:
    print(n, "программистов")
else:
    print(n, "программистов")